---
layout:     post
title:      "Test"
subtitle:   "这是一份测试"
date:       2025-7-30
author:     "Windyeal"
header-img: ""
tags:
    
---

# 概念解释
Qt使用C++语法开发，语法上有着C++的特性，或者说Qt是C++的一个大型拓展库；但不意味着QT是一种语言，还存在PyQt：使用python开发的Qt
Qt面向对象的特性是由于C++的面向对象特性
> 面向对象编程：一种编程范式，与之对应“面向过程编程”

面向对象编程将程序抽象为几个部分包括“对象”“类”“封装”等等；

面向对象与面向过程的区别如下：

**对于炒蛋炒饭，面向过程这样写：**

1，先炒蛋

2，再炒饭

3，倒在一起炒

4，出锅

**而面向对象这样写：**

1，抽象出蛋、米饭、人、锅这几个对象

2，安排蛋这个对象其行为需要被炒

3，安排米饭这个对象其行为需要被炒

4，安排人这个对象其行为需要主动去炒

5，安排锅这个对象其行为需要加热

6，安排被炒后的蛋和米饭需要混在一起再被炒

7，以上6步一起执行然后得出蛋炒饭这个结果

现实中炒饭需要考虑先后顺序，这里仅举例说明两种范式的区别

QtCreator是方便开发者开发Qt的图形化开发环境，本质是一个工业软件，除了QtCreator，使用命令行控制台也可以直接开发Qt，只是不方便
